#include "led.h"
/**************************************************************************
函数功能：LED接口初始化
入口参数：无 
返回  值：无
**************************************************************************/
void LED_Init(void)
{
RCC->APB2ENR|=1<<2; //使能 PORTA 时钟  
GPIOA->CRL&=0XFFF00FFF;
GPIOA->CRL|=0X00033000;//PA4 推挽输出
GPIOA->ODR|=1<<4; //PA4 输出高
	
//RCC->APB2ENR|=1<<3;       //PORTB时钟使能  //使能 PORTB 时钟  
//GPIOB->CRL&=0XFFFFFFF0;
//GPIOB->CRL|=0X00000003;//PB0 推挽输出
//GPIOB->ODR|=1<<0; //PB0 输出高	

}

/**************************************************************************
函数功能：LED闪烁
入口参数：闪烁频率 
返回  值：无
**************************************************************************/
void Led_Flash(u16 time)
{
	  static int temp;
	  if(0==time) LED=0;
	  else		if(++temp==time)	LED=~LED,temp=0;
}
